Output from `terraform plan`
```
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-profile-preproduction" -> "dpr-cdc-prisoner-profile-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        name          = "dpr-replay-pipeline-nomis-prisoner-profile-preproduction"
        tags          = {
            "Domain"         = "prisoner-profile"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["questionnaire"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-questionnaire-preproduction" -> "pending-files-check-questionnaire-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-questionnaire-preproduction" -> "pending-files-check-questionnaire-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-questionnaire-preproduction" -> "dpr-batch-questionnaire-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-questionnaire-preproduction" -> "dpr-cdc-questionnaire-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-questionnaire-preproduction" -> "dpr-cdc-questionnaire-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-questionnaire-preproduction"
        name          = "dpr-replay-pipeline-nomis-questionnaire-preproduction"
        tags          = {
            "Domain"         = "questionnaire"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["reference"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-reference-preproduction" -> "pending-files-check-reference-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-reference-preproduction" -> "pending-files-check-reference-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-reference-preproduction" -> "dpr-batch-reference-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-reference-preproduction" -> "dpr-cdc-reference-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-reference-preproduction" -> "dpr-cdc-reference-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-reference-preproduction"
        name          = "dpr-replay-pipeline-nomis-reference-preproduction"
        tags          = {
            "Domain"         = "reference"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["safety"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-safety-preproduction" -> "pending-files-check-safety-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-safety-preproduction" -> "pending-files-check-safety-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-safety-preproduction" -> "dpr-batch-safety-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-safety-preproduction" -> "dpr-cdc-safety-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-safety-preproduction" -> "dpr-cdc-safety-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-safety-preproduction"
        name          = "dpr-replay-pipeline-nomis-safety-preproduction"
        tags          = {
            "Domain"         = "safety"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["sentence"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-sentence-preproduction" -> "pending-files-check-sentence-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-sentence-preproduction" -> "pending-files-check-sentence-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-sentence-preproduction" -> "dpr-batch-sentence-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-sentence-preproduction" -> "dpr-cdc-sentence-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-sentence-preproduction" -> "dpr-cdc-sentence-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-sentence-preproduction"
        name          = "dpr-replay-pipeline-nomis-sentence-preproduction"
        tags          = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["transactions"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-transactions-preproduction" -> "pending-files-check-transactions-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-transactions-preproduction" -> "pending-files-check-transactions-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-transactions-preproduction" -> "dpr-batch-transactions-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-transactions-preproduction" -> "dpr-cdc-transactions-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-transactions-preproduction" -> "dpr-cdc-transactions-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-transactions-preproduction"
        name          = "dpr-replay-pipeline-nomis-transactions-preproduction"
        tags          = {
            "Domain"         = "transactions"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.replay-pipeline["visits"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
          ~ {
              ~ States  = {
                  ~ "Check All Files Have Been Replayed"                   = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-visits-preproduction" -> "pending-files-check-visits-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Check All Pending Files Have Been Processed"          = {
                      ~ Parameters = {
                          ~ JobName   = "unprocessed-files-check-visits-preproduction" -> "pending-files-check-visits-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Batch Job"                                 = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-batch-visits-preproduction" -> "dpr-batch-visits-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Start Glue Streaming Job"                             = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-reporting-hub-cdc-visits-preproduction" -> "dpr-cdc-visits-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Stop Glue Streaming Job"                              = {
                      ~ Parameters = {
                          ~ Arguments = {
                              ~ "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction" -> "dpr-cdc-visits-preproduction"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Curated"            = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                  ~ "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      ~ Parameters = {
                          ~ JobName   = "dpr-switch-prisons-hive-data-location-preproduction" -> "dpr-switch-prisons-data-source-preproduction"
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    }
                    # (16 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-replay-pipeline-nomis-visits-preproduction"
        name          = "dpr-replay-pipeline-nomis-visits-preproduction"
        tags          = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.setup-dms-endpoints["dps-activities"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id            = "dpr-dms-dps-activities-pgres-source-endpoint"
        tags          = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (12 unchanged attributes hidden)

      ~ postgres_settings {
          ~ fail_tasks_on_lob_truncation = false -> true
          ~ heartbeat_frequency          = 0 -> 5
            # (6 unchanged attributes hidden)
        }
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-basm-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = "PluginName=test_decoding"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 5432
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = false
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = false
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-basm-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-basm-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-basm-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-basm-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-basm-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-basm-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-basm-s3-endpoint-role"
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-inc-reporting-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = "PluginName=test_decoding"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 5432
      + server_name                 = (sensitive value)
      + ssl_mode                    = "require"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = true
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = false
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-inc-reporting-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-inc-reporting-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-inc-reporting-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-inc-reporting-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-inc-reporting-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-inc-reporting-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-inc-reporting"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-inc-reporting-s3-endpoint-role"
    }

Plan: 1131 to add, 323 to change, 957 to destroy.

```